source      = ARGV[0]
text = File.open(source, "r").read

# apply patches

# rename instructors
text = text.gsub("ПРОФЕСИОНАЛНА  АГРОТЕХНИЧЕСКА ГИМНАЗИЯ\"Н\.Й\.ВАПЦАРОВ\"", "ПРОФЕСИОНАЛНА АГРОТЕХНИЧЕСКА ГИМНАЗИЯ \"Н. Й. ВАПЦАРОВ\"")
text = text.gsub("ПРОФЕСИОНАЛНА ТЕХНИЧЕСКА ГИМНАЗИЯ \"НИКОЛА Й.ВАПЦАРОВ\"", "ПРОФЕСИОНАЛНА ТЕХНИЧЕСКА ГИМНАЗИЯ \"НИКОЛА Й. ВАПЦАРОВ\"")
text = text.gsub("ПРОФЕСИОНАЛНА ГИМНАЗИЯ \"ХРИСТО БОТЕВ\"", "ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО ТЕХНИКА И ЕЛЕКТРОТЕХНИКА \"ХРИСТО БОТЕВ\"")
text = text.gsub("ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО МЕХАНОТЕХНИКА И ЕЛЕКТРОНИКА \"М.В.ЛОМОНОСОВ\"", "ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО МЕХАНОТЕХНИКА И ЕЛЕКТРОНИКА \"М. В. ЛОМОНОСОВ\"")
text = text.gsub("ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО МЕХАНОТЕХНИКА И ЕЛЕКТРОНИКА    \"М.В.ЛОМОНОСОВ\"", "ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО МЕХАНОТЕХНИКА И ЕЛЕКТРОНИКА \"М. В. ЛОМОНОСОВ\"")

# TODO which is this school???? text = text.gsub("ПРОФЕСИОНАЛНА ГИМНАЗИЯ", "ПРОФЕСИОНАЛНА ГИМНАЗИЯ \"ТОДОР ПЕЕВ\"")
text = text.gsub("\" ВОЛАН - 2008 \" ООД", "\"ВОЛАН - 2008\" ООД")
text = text.gsub("ЕТ ТИХОВ РОСЕН ТИХОВ", "ЕТ \"ТИХОВ - РОСЕН ТИХОВ\"")
text = text.gsub("\"ДЕЧЕВ АВТО\" ЕООД", "\"ДЕЧЕВ АУТО\" ЕООД")
text = text.gsub("''ВАЛЕНТИ АУТО'' ЕООД", "\"ВАЛЕНТИ АУТО\" ЕООД")

# check if all municipalities are there - if not - add new them
municipalities = ["Благоевград", "Бургас", "Варна", "Велико Търново",
 "Видин", "Враца", "Габрово", "Добрич", "Кърджали", "Кюстендил",
 "Ловеч", "Монтана", "Пазарджик", "Перник", "Плевен", "Пловдив",
 "Разград", "Русе", "Силистра", "Сливен", "Смолян", "София",
 "Стара Загора", "Търговище", "Хасково", "Шумен", "Ямбол"]

municipalities.each_with_index do |m, idx|

  res = text.scan(/^#{m}$/)
  if res.empty?
    # TODO LOGGER!!!!
    # puts "Municipality: #{m} not found in #{file_name}. Patching..."

    text = text.gsub(/^#{municipalities[idx+1]}$/, "#{m}\n#{municipalities[idx+1]}")
  end

end

puts text

